Repository: TableProApp/TablePro
Catalog: TablePro/Resources/Localizable.xcstrings
Source language: en
Languages: fr, ko, tr, vi, zh_hans, zh_hant

source: Merge All Windows
fr: Fusionner toutes les fenêtres
ko: 모든 윈도우 통합
tr: Tüm Pencereleri Birleştir
vi: Hợp nhất tất cả cửa sổ
zh_hans: 合并所有窗口
zh_hant: 合併所有視窗

source: Tab that was raised
fr: Fichier qui a été relevé
ko: 활성화된 탭
tr: Öne çıkarılan sekme
vi: Tab đã được kích hoạt
zh_hans: 被激活的标签页
zh_hant: 被啟用的標籤頁

source: Highlight When Focused
fr: Mettez en évidence lorsque vous êtes concentré

source: Partly copied
fr: Partiellement copié

source: Row Number
fr: Numéro de rangée
ko: 행 번호
tr: Satır Numarası
vi: Số thứ tự dòng
zh_hans: 行号
zh_hant: 列號

source: Constraints
fr: Contraintes
ko: 제약 조건
tr: Kısıtlamalar
vi: Ràng buộc
zh_hans: 约束
zh_hant: 約束

source: Retention
fr: Rétention
ko: 보존 기간
vi: Lưu giữ
zh_hans: 保留
zh_hant: 保留

source: Steps to Reproduce
fr: Étapes à reproduire
ko: 재현 단계
tr: Yeniden Üretme Adımları
vi: Các bước tái hiện
zh_hans: 重现步骤
zh_hant: 重現步驟

source: A group cannot be moved inside itself.
fr: Un groupe ne peut pas être déplacé à l'intérieur de lui-même.
ko: 그룹을 자기 자신 안으로 이동할 수 없습니다.
tr: Bir grup kendi içine taşınamaz.
vi: Không thể di chuyển một nhóm vào chính nó.
zh_hans: 分组不能移动到自身内部。
zh_hant: 群組無法移動到自身內部。

# Transfer of %@ failed: %@
source: Transfer of %1$@ failed: %2$@
fr: Le transfert de %1$@ a échoué : %2$@
ko: %1$@ 전송 실패: %2$@
tr: %1$@ aktarımı başarısız oldu: %2$@
vi: Truyền %1$@ thất bại: %2$@
zh_hans: %1$@ 传输失败：%2$@
zh_hant: %1$@ 傳輸失敗：%2$@

source: Create New View…
fr: Créer une nouvelle vue...
ko: 새 뷰 생성…
tr: Yeni Görünüm Oluştur…
vi: Tạo view mới…
zh_hans: 新建视图…
zh_hant: 建立新的檢視表…

source: The run was rolled back. %@ is unchanged.
fr: La course a été annulée. %@ n'a pas changé.
ko: 실행이 롤백되었습니다. %@은(는) 변경되지 않았습니다.
tr: Çalıştırma geri alındı. %@ değişmedi.
vi: Lần chạy đã được khôi phục. %@ không thay đổi.
zh_hans: 本次运行已回滚。%@ 未发生更改。
zh_hant: 本次執行已復原。%@ 未發生變更。

source: X Axis
fr: Équateur X
ko: X축
tr: X Ekseni
vi: Trục X
zh_hans: X 轴
zh_hant: X 軸

source: No %@
fr: Pas de %@
ko: %@ 없음
tr: %@ Yok
vi: Không có %@
zh_hans: 没有%@
zh_hant: 沒有 %@

source: Enable SOCKS Proxy
fr: Activer le proxy SOCKS
ko: SOCKS 프록시 활성화
tr: SOCKS Proxy'yi Etkinleştir
vi: Bật SOCKS Proxy
zh_hans: 启用 SOCKS 代理
zh_hant: 啟用 SOCKS 代理

source: No DDL available
fr: Aucune DDL disponible
ko: 사용 가능한 DDL 없음
tr: DDL mevcut değil
vi: Không có DDL
zh_hans: 无可用 DDL
zh_hant: 無可用的 DDL

source: EU Short (31/12/2024)
fr: Courtage en euros (31/12/2024)
ko: EU 짧은 형식(31/12/2024)
tr: AB Kısa (31/12/2024)
vi: Châu Âu ngắn (31/12/2024)
zh_hans: 欧洲短格式 (31/12/2024)
zh_hant: 歐洲短格式 (31/12/2024)

source: Copy token
fr: Copier le jeton
ko: 토큰 복사
tr: Token kopyala
vi: Sao chép token
zh_hans: 复制令牌
zh_hant: 複製權杖

source: Delimiter
fr: Délimiteur
ko: 구분자
tr: Ayırıcı
vi: Dấu phân cách
zh_hans: 分隔符
zh_hant: 分隔符號

source: The selected backup file is not readable.
fr: Le fichier de sauvegarde sélectionné n'est pas lisible.
ko: 선택한 백업 파일을 읽을 수 없습니다.
tr: Seçilen yedek dosyası okunamıyor.
vi: Không đọc được file sao lưu đã chọn.
zh_hans: 所选备份文件不可读。
zh_hant: 所選的備份檔案無法讀取。

source: User-Defined
fr: Définis par l'utilisateur

source: An HTML table. Open in a browser or paste into a page.
fr: Une table HTML. Ouvrez-la dans un navigateur ou collez-la dans une page.

source: TLS Mode
fr: Mode TLS
ko: TLS 모드
tr: TLS Modu
vi: Chế độ TLS
zh_hans: TLS 模式
zh_hant: TLS 模式

source: The procedures and functions in %1$@ could not be listed: %2$@
fr: Les procédures et fonctions dans %1$@ ne pouvaient pas être listées : %2$@

source: API token
fr: Token API
ko: API 토큰
tr: API anahtarı
vi: Mã API
zh_hans: API 令牌
zh_hant: API 權杖

source: Export multiple tables
fr: Exporter plusieurs tableaux
ko: 여러 테이블 내보내기
tr: Birden fazla tabloyu dışa aktar
vi: Xuất nhiều bảng
zh_hans: 导出多个表
zh_hant: 匯出多個資料表

source: Number of partitions, for a partitioned table
fr: Nombre de partitions, pour une table partagée.

source: Statements already executed stay committed.
fr: Les déclarations déjà exécutées restent engagées.

source: No roles have access yet. Add one to grant it.
fr: Aucun rôle n'a encore accès. Ajoutez-en un pour le donner.

source: Get in touch and we will sort it out.
fr: Contactez-nous et nous nous occuperons de tout.
ko: 문의해 주시면 해결해 드리겠습니다.
tr: Bize ulaşın, birlikte çözelim.
vi: Hãy liên hệ và chúng tôi sẽ xử lý.
zh_hans: 请联系我们，我们会协助解决。
zh_hant: 請聯絡我們，我們會協助解決。

source: Copy with Headers
fr: Copier avec des en-têtes
ko: 헤더와 함께 복사
tr: Başlıklarla Kopyala
vi: Sao chép kèm tiêu đề
zh_hans: 复制（含表头）
zh_hant: 複製（含標題）

source: Lists a partitioned table's partitions under it in the sidebar, with how many it holds. Turn it off to keep partitioned tables as single rows.
fr: Liste les partitions d'une table partagée sous celle-ci dans la barre latérale, avec le nombre de partitions qu'elle contient. Désactivez-la pour conserver les tables partagées comme des lignes uniques.

source: Compared %@. 1 difference. Nothing has been written.
fr: Comparé %@. 1 différence. Rien n'a été écrit.
ko: %@을(를) 비교했습니다. 차이점 1개. 아무것도 기록되지 않았습니다.
tr: %@ karşılaştırıldı. 1 fark. Hiçbir şey yazılmadı.
vi: Đã so sánh %@. 1 khác biệt. Chưa ghi gì cả.
zh_hans: 已比较 %@。1 处差异。尚未写入任何内容。
zh_hant: 已比較 %@。1 處差異。尚未寫入任何內容。

source: %@ was not found on this system. Install it with `brew install libpq` and link it.
fr: %@ n'a pas été trouvé sur ce système. Installez-le avec `brew install libpq` et liez-le.
ko: 이 시스템에서 %@ 프로그램을 찾을 수 없습니다. `brew install libpq`로 설치하고 링크하십시오.
tr: %@ bu sistemde bulunamadı. `brew install libpq` ile yükleyin ve bağlayın.
vi: Không tìm thấy %@ trên hệ thống này. Cài đặt bằng `brew install libpq` rồi liên kết nó.
zh_hans: 在此系统上未找到%@。请使用`brew install libpq`安装并链接它。
zh_hant: 在這個系統上找不到 %@。請使用 `brew install libpq` 安裝並連結它。

source: External access is disabled for this connection
fr: L'accès externe est désactivé pour cette connexion.
ko: 이 연결에서는 외부 접근이 비활성화되어 있습니다
tr: Bu bağlantı için harici erişim devre dışı
vi: Truy cập bên ngoài đã bị tắt cho kết nối này
zh_hans: 该连接已禁用外部访问
zh_hant: 此連線已停用外部存取

source: Display As
fr: Afficher comme
ko: 표시 형식
tr: Farklı Görüntüle
vi: Hiển thị dạng
zh_hans: 显示为
zh_hant: 顯示為

source: Run one destructive statement (DROP, TRUNCATE, ALTER...DROP). The user approves it before it runs: through your elicitation prompt when your client supports elicitation, otherwise through TablePro's own confirmation dialog on the user's Mac. Needs tools:write and a connection the user left writable for external clients.
fr: Exécutez une déclaration destructrice (DROP, TRUNCATE, ALTER...DROP). L'utilisateur l'approuve avant qu'elle ne soit exécutée : via votre prompt d'élicitation lorsque votre client prend en charge l'élicitation, sinon via la propre boîte de dialogue de confirmation de TablePro sur le Mac de l'utilisateur. Besoin d'outils : écrire et une connexion que l'utilisateur a laissé écrivable pour les clients externes.
ko: 파괴적인 명령문(DROP, TRUNCATE, ALTER...DROP) 하나를 실행합니다. 실행 전에 사용자가 승인합니다. 클라이언트가 elicitation을 지원하면 해당 프롬프트로, 그렇지 않으면 사용자의 Mac에 표시되는 TablePro 자체 확인 대화상자로 승인합니다. tools:write와, 사용자가 외부 클라이언트에 쓰기를 허용한 연결이 필요합니다.
tr: Yıkıcı tek bir ifade (DROP, TRUNCATE, ALTER...DROP) çalıştırır. Çalışmadan önce kullanıcı onaylar: istemciniz elicitation destekliyorsa sizin sorunuzla, aksi halde kullanıcının Mac'indeki TablePro onay penceresiyle. tools:write ve kullanıcının dış istemcilere yazılabilir bıraktığı bir bağlantı gerektirir.
vi: Chạy một câu lệnh có tính phá huỷ (DROP, TRUNCATE, ALTER...DROP). Người dùng phê duyệt trước khi nó chạy: qua lời nhắc elicitation nếu client của bạn hỗ trợ, nếu không thì qua hộp thoại xác nhận của chính TablePro trên máy Mac của người dùng. Cần tools:write và một kết nối mà người dùng để ghi được cho client bên ngoài.
zh_hans: 运行一条破坏性语句（DROP、TRUNCATE、ALTER...DROP）。运行前由用户批准：若你的客户端支持 elicitation，则通过你的询问提示；否则通过用户 Mac 上 TablePro 自己的确认对话框。需要 tools:write，以及一个用户对外部客户端保留可写的连接。
zh_hant: 執行一條破壞性陳述式（DROP、TRUNCATE、ALTER...DROP）。執行前由使用者核准：若你的用戶端支援 elicitation，則透過你的詢問提示；否則透過使用者 Mac 上 TablePro 自己的確認對話框。需要 tools:write，以及一個使用者對外部用戶端保留可寫入的連線。

source: Rows to skip (default 0)
fr: Lignes à sauter (par défaut 0)
ko: 건너뛸 행 수(기본값 0)
tr: Atlanacak satırlar (varsayılan 0)
vi: Số dòng cần bỏ qua (mặc định 0)
zh_hans: 要跳过的行数（默认 0）
zh_hant: 要略過的列數（預設 0）

source: Each SQLite file is a separate database. To open a different database, create a new connection.
fr: Chaque fichier SQLite est une base de données distincte. Pour ouvrir une base de données différente, créez une nouvelle connexion.
ko: 각 SQLite 파일은 별도의 데이터베이스입니다. 다른 데이터베이스를 열려면 새 연결을 생성하십시오.
tr: Her SQLite dosyası ayrı bir veritabanıdır. Farklı bir veritabanı açmak için yeni bağlantı oluşturun.
vi: Mỗi tệp SQLite là một cơ sở dữ liệu riêng. Để mở cơ sở dữ liệu khác, hãy tạo kết nối mới.
zh_hans: 每个 SQLite 文件是一个独立的数据库。 要打开其他数据库，请创建新连接。
zh_hant: 每個 SQLite 檔案都是獨立的資料庫。 若要開啟其他資料庫，請建立新連線。

source: No Earlier Plans
fr: Aucun plan plus ancien
ko: 이전 계획 없음
tr: Önceki Plan Yok
vi: Không có kế hoạch trước đó
zh_hans: 没有先前的执行计划
zh_hant: 沒有先前的執行計畫

source: Container service name, may be unreachable
fr: Nom du service de conteneur, peut ne pas être accessible
ko: 컨테이너 서비스 이름이므로 연결할 수 없을 수 있습니다
tr: Container servis adı, erişilemeyebilir
vi: Tên dịch vụ container, có thể không truy cập được
zh_hans: 容器服务名称，可能无法访问
zh_hant: 容器服務名稱，可能無法連線

source: Could not decode image
fr: Impossible de décoder l'image
ko: 이미지를 디코딩할 수 없습니다
tr: Görüntünün kodu çözülemedi
vi: Không thể giải mã hình ảnh
zh_hans: 无法解码图像
zh_hant: 無法解碼影像

source: Only when I use the connection
fr: Seulement lorsque j'utilise la connexion

source: Refresh database list
fr: Recharger la liste de la base de données
ko: 데이터베이스 목록 새로 고침
vi: Làm mới danh sách cơ sở dữ liệu
zh_hans: 刷新数据库列表
zh_hant: 重新整理資料庫清單

source: Dotted scope path, '*' for server
fr: Chemin de portée pointillé, '*' pour le serveur
ko: 점으로 구분된 범위 경로이며, 서버는 '*'입니다
tr: Noktalı kapsam yolu, sunucu için '*'
vi: Đường dẫn phạm vi phân tách bằng dấu chấm, '*' cho máy chủ
zh_hans: 以点分隔的作用域路径，服务器用 '*'
zh_hant: 以點分隔的範圍路徑，伺服器用 '*'

source: Failed to load plugin registry
fr: Échec du chargement du registre des plugins.
ko: 플러그인 레지스트리를 불러오지 못했습니다
tr: Eklenti kaydı yüklenemedi
vi: Không thể tải danh sách plugin
zh_hans: 无法加载插件注册表
zh_hant: 無法載入外掛註冊

source: Admin
fr: Administratif
ko: 관리자
tr: Yönetici
vi: Quản trị viên
zh_hans: 管理员
zh_hant: 管理員

source: Execute a SQL query against a connection. The connection's safe mode policy applies. Multi-statement queries are rejected, except on SQL Server, where a whole script runs batch by batch at its GO lines and result_sets lists every result set when there is more than one. Destructive operations (DROP, TRUNCATE, ALTER...DROP) are blocked here; use confirm_destructive_operation instead.
fr: Exécutez une requête SQL contre une connexion. La politique de mode sûr de la connexion s'applique. Les requêtes à plusieurs déclarations sont rejetées, sauf sur SQL Server, où un tout script s'exécute en lots sur ses lignes GO et la liste result_sets liste chaque ensemble de résultats lorsqu'il y en a plus d'un. Les opérations destructrices (DROP, TRUNCATE, ALTER...DROP) sont bloquées ici ; utilisez plutôt confirm_destructive_operation.

source: Drop selected database
fr: Déposer la base de données sélectionnée
ko: 선택한 데이터베이스 삭제
tr: Seçili veritabanını sil
vi: Xoá cơ sở dữ liệu đã chọn
zh_hans: 删除选定的数据库
zh_hant: 刪除選取的資料庫

source: Icon Sizes
fr: Tailles des icônes
ko: 아이콘 크기
tr: Simge Boyutları
vi: Kích thước biểu tượng
zh_hans: 图标大小
zh_hant: 圖示大小

source: Every row must be an array with one value per column.
fr: Chaque rangée doit être une matrice avec une valeur par colonne.
ko: 모든 행은 열마다 값 하나를 가진 배열이어야 합니다.
tr: Her satır, sütun başına bir değer içeren bir dizi olmalıdır.
vi: Mỗi dòng phải là một mảng có một giá trị cho mỗi cột.
zh_hans: 每一行都必须是数组，每列对应一个值。
zh_hant: 每一列都必須是陣列，每個欄位對應一個值。

source: Could not protect the save history.
fr: Impossible de protéger l'historique des sauvegardes.
ko: 저장 기록을 보호할 수 없습니다.
tr: Kaydetme geçmişi korunamadı.
vi: Không bảo vệ được lịch sử lưu.
zh_hans: 无法保护保存历史。
zh_hant: 無法保護儲存記錄。

source: Expression (e.g., age >= 0)
fr: Expression (par exemple, âge >= 0)
ko: 표현식(예: age >= 0)
tr: İfade (örn. age >= 0)
vi: Biểu thức (vd: age >= 0)
zh_hans: 表达式（如 age >= 0）
zh_hant: 運算式（例如 age >= 0）

source: Match System
fr: Système de correspondance
ko: 시스템 설정 따르기
tr: Sistemle Aynı
vi: Theo hệ thống
zh_hans: 跟随系统
zh_hant: 跟隨系統

# Row %@ is not valid JSON near byte %@.
source: Row %1$@ is not valid JSON near byte %2$@.
fr: La ligne %1$@ n'est pas une JSON valide près du byte %2$@.

source: Error:
fr: Erreur :
ko: 오류:
tr: Hata:
vi: Lỗi:
zh_hans: 错误:
zh_hant: 錯誤：

source: Write a migration and its rollback
fr: Écrire une migration et son rétroaction.
ko: 마이그레이션과 롤백 작성
tr: Bir geçiş ve geri alma adımı yaz
vi: Viết một migration và bước rollback của nó
zh_hans: 写一份迁移及其回滚
zh_hant: 寫一份遷移及其回復

source: Installed
fr: Installer
ko: 설치됨
tr: Yüklendi
vi: Đã cài đặt
zh_hans: 已安装
zh_hant: 已安裝

source: Switch Connection
fr: Échange de connexion
ko: 연결 전환
tr: Bağlantı Değiştir
vi: Chuyển kết nối
zh_hans: 切换连接
zh_hant: 切換連線

source: Share anonymous usage data
fr: Partager des données d'utilisation anonymes
ko: 익명 사용 데이터 공유
tr: Anonim kullanım verilerini paylaş
vi: Chia sẻ dữ liệu sử dụng ẩn danh
zh_hans: 共享匿名使用数据
zh_hant: 分享匿名使用資料

source: Select a Library
fr: Sélectionnez une bibliothèque
ko: 라이브러리 선택
tr: Bir Kitaplık Seçin
vi: Chọn một thư viện
zh_hans: 选择一个库
zh_hant: 選擇一個程式庫

source: The server wrote %1$@ to %2$@.
fr: Le serveur a écrit %1$@ à %2$@.

source: %d more lines
fr: %d lignes de plus
ko: %d줄 더
tr: %d satır daha
vi: %d dòng nữa
zh_hans: 还有 %d 行
zh_hant: 還有 %d 行

source: Could not build an INSERT for the mapped columns
fr: Impossible de construire une INSERT pour les colonnes mappées.
ko: 매핑된 열에 대한 INSERT를 만들 수 없습니다
tr: Eşlenen sütunlar için bir INSERT oluşturulamadı
vi: Không dựng được câu INSERT cho các cột đã ánh xạ
zh_hans: 无法为已映射的列构建 INSERT 语句
zh_hant: 無法為已對應的欄位建立 INSERT 陳述式

source: Starter
fr: Démarreur

source: Search All Rows
fr: Rechercher toutes les lignes
ko: 모든 행 검색
tr: Tüm Satırlarda Ara
vi: Tìm trong tất cả dòng
zh_hans: 搜索所有行
zh_hant: 搜尋所有列

source: Hide TablePro
fr: Cacher TablePro
ko: TablePro 가리기
tr: TablePro'yu Gizle
vi: Ẩn TablePro
zh_hans: 隐藏 TablePro
zh_hant: 隱藏 TablePro

source: This statement drops or truncates data. Use confirm_destructive_operation for it.
fr: Cette instruction supprime ou tronque les données. Utilisez confirm_destructive_operation pour cela.
ko: 이 명령문은 데이터를 삭제하거나 잘라냅니다. 이 경우 confirm_destructive_operation을 사용하십시오.
tr: Bu ifade veriyi siliyor veya boşaltıyor. Bunun için confirm_destructive_operation kullanın.
vi: Câu lệnh này xoá hoặc truncate dữ liệu. Hãy dùng confirm_destructive_operation cho nó.
zh_hans: 此语句会删除或清空数据。请为它使用 confirm_destructive_operation。
zh_hant: 此陳述式會刪除或清空資料。請為它使用 confirm_destructive_operation。

source: Failed to parse connections: %@
fr: Échec de la parsemation des connexions : %@
ko: 연결을 구문 분석하지 못했습니다: %@
tr: Bağlantılar ayrıştırılamadı: %@
vi: Không thể phân tích kết nối: %@
zh_hans: 解析连接失败：%@
zh_hant: 解析連線失敗：%@

# Activations (%lld of %lld)
source: Activations (%1$lld of %2$lld)
fr: Activations (%1$lld de %2$lld)
ko: 활성화(%1$lld/%2$lld)
tr: Etkinleştirmeler (%lld / %lld)
vi: Kích hoạt (%1$lld / %2$lld)
zh_hans: 激活数（%lld / %lld）
zh_hant: 啟用數（%1$lld / %2$lld）

source: The transfer was cancelled.
fr: Le transfert a été annulé.
ko: 전송이 취소되었습니다.
tr: Aktarım iptal edildi.
vi: Việc truyền đã bị huỷ.
zh_hans: 传输已取消。
zh_hant: 傳輸已取消。

source: Row %d
fr: Ligne %d
ko: %d행
tr: Satır %d
vi: Dòng %d
zh_hans: 第%d行
zh_hant: 第 %d 列

source: asterisk
fr: astérisque
ko: 별표
tr: yıldız işareti
vi: dấu sao
zh_hans: 星号
zh_hant: 星號

source: 1Password's own socket. 1Password has to be running and unlocked.
fr: Le propre socket de 1Password. 1Password doit être en cours d'exécution et déverrouillé.

source: All rows…
fr: Toutes les lignes...
ko: 모든 행…
tr: Tüm satırlar…
vi: Tất cả các hàng…
zh_hans: 所有行…
zh_hant: 所有列…

source: The MCP server could not bind a port (%@)
fr: Le serveur MCP n'a pas pu associer une porte (%@)
ko: MCP 서버가 포트를 바인딩하지 못했습니다(%@)
tr: MCP sunucusu bir bağlantı noktasına bağlanamadı (%@)
vi: Máy chủ MCP không bind được cổng (%@)
zh_hans: MCP 服务器无法绑定端口（%@）
zh_hant: MCP 伺服器無法繫結連接埠（%@）

source: Restore previous values
fr: Restaurer les valeurs précédentes
ko: 이전 값 복원
tr: Önceki değerleri geri yükle
vi: Khôi phục giá trị trước đó
zh_hans: 恢复之前的值
zh_hant: 還原先前的值

source: Highlight color
fr: Couleur de mise en évidence

source: Failed to parse connection file: %@
fr: Échec de la parsemation du fichier de connexion : %@
ko: 연결 파일을 해석하지 못했습니다: %@
tr: Bağlantı dosyası ayrıştırılamadı: %@
vi: Không thể phân tích tệp kết nối: %@
zh_hans: 无法解析连接文件：%@
zh_hant: 無法解析連線檔案：%@

source: Default row sort is applied when a table first opens. Sort direction also sets which way the first click on a column header sorts.
fr: L'ordre par rangée par défaut est appliqué lorsque la table s'ouvre pour la première fois. La direction d'ordre définit également dans quelle direction le premier clic sur un en-tête de colonne est effectué.
ko: 기본 행 정렬은 테이블을 처음 열 때 적용됩니다. 정렬 방향은 열 머리글을 처음 클릭했을 때의 정렬 방향도 결정합니다.
tr: Varsayılan satır sıralaması tablo ilk açıldığında uygulanır. Sıralama yönü, bir sütun başlığına yapılan ilk tıklamanın yönünü de belirler.
vi: Sắp xếp hàng mặc định được áp dụng khi mở bảng lần đầu. Hướng sắp xếp cũng quyết định chiều sắp xếp của lần nhấp đầu tiên vào tiêu đề cột.
zh_hans: 默认行排序在首次打开表时应用。排序方向同时决定首次点击列标题时的排序方向。
zh_hant: 預設列排序在首次開啟表格時套用。排序方向同時決定首次點按欄標題時的排序方向。

source: Prevent CSV formula injection by prefixing values starting with =, +, -, @ with a single quote
fr: Empêcher l'injection de formules CSV en préfixant les valeurs commençant par =, +, -, @ par un guillemets simple.
ko: =, +, -, @로 시작하는 값 앞에 작은따옴표(')를 붙여 CSV 수식 삽입을 방지합니다
vi: Ngăn chặn chèn công thức CSV bằng cách thêm dấu nháy đơn trước các giá trị bắt đầu bằng =, +, -, @
zh_hans: 通过在以 =、+、-、@ 开头的值前添加单引号来防止 CSV 公式注入
zh_hant: 在以 =、+、-、@ 開頭的值前加上單引號，以防止 CSV 公式注入

source: Quick Switcher (⌘P)
fr: Interrupteur rapide (⌘P)
ko: 빠른 전환(⌘P)
vi: Chuyển đổi nhanh (⌘P)
zh_hans: 快速切换 (⌘P)
zh_hant: 快速切換器 (⌘P)

source: Cannot Import
fr: Impossible d'importer

source: Under MCP Servers click "+ Add Custom Server", select the Local tab, paste the JSON below, then click Add Server
fr: Sous les serveurs MCP, cliquez sur "+ Ajouter un serveur personnalisé", sélectionnez l'onglet Local, collez le JSON ci-dessous, puis cliquez sur Ajouter un serveur.
ko: MCP 서버에서 "+ 사용자 지정 서버 추가"를 클릭하고 로컬 탭을 선택한 다음 아래 JSON을 붙여넣고 서버 추가를 클릭하십시오
tr: MCP Servers bölümünde "+ Add Custom Server" düğmesine tıklayın, Local sekmesini seçin, aşağıdaki JSON'u yapıştırın, sonra Add Server düğmesine tıklayın
vi: Trong mục MCP Servers, bấm "+ Add Custom Server", chọn tab Local, dán JSON bên dưới rồi bấm Add Server
zh_hans: 在 MCP Servers 下点按 "+ Add Custom Server"，选择 Local 标签页，粘贴下方的 JSON，然后点按 Add Server
zh_hant: 在 MCP Servers 下點按「+ Add Custom Server」，選擇 Local 標籤頁，貼上下方的 JSON，然後點按 Add Server

source: No credentials are sent. Use this when the server handles authentication itself, such as a Tailscale SSH host.
fr: Aucune pièce d'identité n'est envoyée. Utilisez-la lorsque le serveur gère lui-même l'authentification, comme un hôte SSH Tailscale.
ko: 자격 증명이 전송되지 않습니다. Tailscale SSH 호스트처럼 서버가 인증을 직접 처리할 때 사용하십시오.
tr: Hiçbir kimlik bilgisi gönderilmez. Sunucunun kimlik doğrulamayı kendi yaptığı durumlarda, örneğin Tailscale SSH sunucusunda kullanın.
vi: Không gửi thông tin đăng nhập nào. Dùng khi máy chủ tự xử lý xác thực, ví dụ máy chủ SSH của Tailscale.
zh_hans: 不会发送任何凭据。当服务器自行处理认证时使用，例如 Tailscale 的 SSH 主机。
zh_hant: 不會傳送任何認證資訊。當伺服器自行處理驗證時使用，例如 Tailscale 的 SSH 主機。

source: Changing check constraint %@ re-checks every existing row and fails if any violates it.
fr: La modification de la contrainte de vérification %@ réexamine chaque ligne existante et échoue si l'une d'entre elles la viole.
ko: CHECK 제약 조건 %@을(를) 변경하면 기존 행을 모두 다시 검사하며, 하나라도 위반하면 실패합니다.
tr: %@ kontrol kısıtlamasını değiştirmek mevcut her satırı yeniden denetler ve herhangi biri ihlal ederse başarısız olur.
vi: Thay đổi ràng buộc CHECK %@ sẽ kiểm tra lại mọi dòng hiện có và thất bại nếu có dòng vi phạm.
zh_hans: 修改 CHECK 约束 %@ 会重新检查每一个现有行，若有任何行违反则会失败。
zh_hant: 修改 CHECK 約束 %@ 會重新檢查每一個現有列，若有任何列違反則會失敗。

source: Show object comments
fr: Afficher les commentaires sur l'objet
ko: 객체 주석 보기
tr: Nesne yorumlarını göster
vi: Hiện ghi chú đối tượng
zh_hans: 显示对象注释
zh_hant: 顯示物件註解

source: Claude Code reported an error.
fr: Claude Code a signalé une erreur.
ko: Claude Code에서 오류를 보고했습니다.
tr: Claude Code bir hata bildirdi.
vi: Claude Code báo lỗi.
zh_hans: Claude Code 报告了一个错误。
zh_hant: Claude Code 回報了一個錯誤。

source: Approval is separate from what a client may reach. A connection blocked for external clients stays blocked, a read-only one stays read only, and Safe Mode still confirms destructive statements.
fr: L'approbation est distincte de ce que un client peut atteindre. Une connexion bloquée pour les clients externes reste bloquée, une connexion en lecture seule reste en lecture seule, et la mode sécurisée confirme toujours les déclarations destructrices.

source: Run against this database (uses current if omitted)
fr: Exécutez contre cette base de données (utilise la version actuelle si elle est omise)
ko: 이 데이터베이스에서 실행(생략 시 현재 데이터베이스 사용)
tr: Bu veritabanında çalıştır (belirtilmezse geçerli olan kullanılır)
vi: Chạy trên cơ sở dữ liệu này (bỏ trống thì dùng cái hiện tại)
zh_hans: 在此数据库上运行（省略则使用当前数据库）
zh_hant: 在此資料庫上執行（省略則使用目前的資料庫）

source: %1$@, color %2$@
fr: %1$@, couleur %2$@
ko: %1$@, 색상 %2$@
tr: %1$@, renk %2$@
vi: %1$@, màu %2$@
zh_hans: %1$@，颜色 %2$@
zh_hant: %1$@，顏色 %2$@

source: %d rows selected.
fr: %d lignes sélectionnées.

source: Disk Usage
fr: Utilisation du disque
ko: 디스크 사용량
tr: Disk Kullanımı
vi: Sử dụng ổ đĩa
zh_hans: 磁盘使用量
zh_hant: 磁碟使用量

source: License Expired
fr: Licence expirée
ko: 라이선스가 만료되었습니다
tr: Lisansın süresi doldu
vi: Giấy phép đã hết hạn
zh_hans: 许可证已过期
zh_hant: 授權已過期

source: Side
fr: Côté

source: Edit…
fr: Modifier...
ko: 편집…
tr: Düzenle…
vi: Sửa…
zh_hans: 编辑…
zh_hant: 編輯…

source: Loading options...
fr: Chargement des options...
ko: 옵션 불러오는 중...
tr: Seçenekler yükleniyor...
vi: Đang tải tùy chọn...
zh_hans: 正在加载选项…
zh_hant: 正在載入選項…

source: The question to answer, in plain language
fr: La question à répondre, en langage clair
ko: 일상어로 답해야 할 질문
tr: Yanıtlanacak soru, sade dille
vi: Câu hỏi cần trả lời, bằng ngôn ngữ đời thường
zh_hans: 要回答的问题，用日常语言表达
zh_hant: 要回答的問題，用日常語言表達

source: Only %1$d of %2$d bytes of %3$@ arrived.
fr: Seulement %1$d de %2$d octets de %3$@ sont arrivés.
ko: %3$@의 %2$d바이트 중 %1$d바이트만 도착했습니다.
tr: %3$@ için %2$d baytın yalnızca %1$d baytı ulaştı.
vi: Chỉ %1$d trên %2$d byte của %3$@ đã tới.
zh_hans: %3$@ 的 %2$d 字节中只到达了 %1$d 字节。
zh_hant: %3$@ 的 %2$d 位元組中只到達了 %1$d 位元組。

source: Switch Connection…
fr: Changer la connexion...
ko: 연결 전환…
tr: Bağlantı Değiştir…
vi: Chuyển kết nối…
zh_hans: 切换连接…
zh_hant: 切換連線…

source: %1$@ of %2$@
fr: %1$@ de %2$@
vi: %1$@ trên %2$@

# Saved %@ of “%@” to %@
source: Saved %1$@ of “%2$@” to %3$@
fr: %1$@ de "%2$@" a été sauvegardé dans %3$@
ko: “%2$@”의 %1$@을(를) %3$@에 저장했습니다
tr: “%2$@” (%1$@) şuraya kaydedildi: %3$@
vi: Đã lưu %1$@ của “%2$@” vào %3$@
zh_hans: 已将“%2$@”的 %1$@ 保存到 %3$@
zh_hant: 已將「%1$@」的 %2$@ 儲存至 %3$@

source: Null
fr: Nul

source: %d statements failed. What already ran stays applied. Compare again to see where the target stands.
fr: %d déclarations ont échoué. Ce qui a déjà été exécuté reste appliqué. Comparez à nouveau pour voir où se trouve la cible.

source: Insert into editor
fr: Insérer dans l'éditeur
ko: 편집기에 삽입
tr: Düzenleyiciye ekle
vi: Chèn vào trình soạn thảo
zh_hans: 插入到编辑器
zh_hant: 插入到編輯器

source: Shortcut recorder
fr: Récepteur de raccourcis
ko: 단축키 기록기
tr: Kısayol kaydedici
vi: Ghi phím tắt
zh_hans: 快捷键录制
zh_hant: 快速鍵錄製器
